Revit 2026 API

# CurveReference Property

---

Returns a stable reference to the curve.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Reference Reference { get; }
```
```vb
Public ReadOnly Property Reference As Reference
	Get
```
```cpp
public:
property Reference^ Reference {
	Reference^ get ();
}
```
```fsharp
member Reference : Reference with get
```

#### Property Value

ReferenceThis value is set for curve geometry obtained from Revit elements.  if the curve was created via parameters, copying, transform, or other operations.

This value is also if the corresponding geometry object does not permit referencing.

#### Reference

Curve Class

Autodesk.Revit.DB Namespace